system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         400;

deltaT          0.000001;

writeControl    adjustableRunTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo  0.9;
functions
{
	forces
	{
    		type          forceCoeffs;
    		libs          ("libforces.so");
    		patches       (walls);	
     		rho           rhoInf;     
     		rhoInf        1;          
     		CofR          (0 0 0);    
     		liftDir       (0 1 0);
     		dragDir       (1 0 0);
		pitchAxis     (0 0 1);
     		magUInf       1;
     		lRef          1;
     		Aref          1;
	} 
}

libs 
(
	"libsixDoFRigidBodyMotion.so"
	"libforces.so"
	"libOpenFOAM.so"
	"libincompressibleRASmodels.so"
	"libfvMotionSolvers.so"
);

// ************************************************************************* //

// ************************************************************************* //
